Unpin deps for newer version of mermaid
